added mathematical detail and more options for gating mechanism to implementation
